# RepeatingDetailSpacingZeroError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DetailFailures..::..RepeatingDetailSpacingZeroError Property
BuiltInFailures..::..DetailFailures Class See Also
---
Spacing must be greater than 0
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RepeatingDetailSpacingZeroError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RepeatingDetailSpacingZeroError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RepeatingDetailSpacingZeroError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DetailFailures Class
Autodesk.Revit.DB Namespace